АлогистикТест2/src/Documents/алк_Аддендумы/алк_Аддендумы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Аддендумы</name>
  <comment>Уточнение договора на поставку товаров клиенту</comment>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыАддендума</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУсловийПоставки</name>
    <type>
      <types>CatalogRef.алк_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАддендума</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАддендума</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияЗапрещены</name>
    <comment>Устанавливают после регистрации в ЛесЕГАИС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаРазрешена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВручную</name>
      <comment>Если Да - пользователь вводит руками, если нет - перезаполняется по нашим алгоритмам</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставТоваров</name>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаОт</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаДо</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПрипуска</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПакетыПоАддендумам/алк_ПакетыПоАддендумам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПакетыПоАддендумам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_СтатусыАддендума/алк_СтатусыАддендума.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СтатусыАддендума</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_Аддендумы/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьНовыйУникальныйИдентификатор()
	Возврат Строка(новый УникальныйИдентификатор());
КонецФункции

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	уникальный = ложь;
	НовыйИдентификатор = "";
	Пока Не уникальный Цикл
		НовыйИдентификатор = ПолучитьНовыйУникальныйИдентификатор();
		уникальный = Истина;
		Для каждого Товар из Объект.Товары Цикл
			Если Товар.ИдентификаторТовара = НовыйИдентификатор тогда
				уникальынй = ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.ИдентификаторТовара = НовыйИдентификатор;
	//НоваяСтрока.ПредставлениеТовара = "Для установки состава нажмите ""Установить состав"""
	Отказ = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьНаличиеПривязанныхПакетовКИдентификаторуПриУдалении(ДокументСсылка, ИдентификаторТовара, Отказ)
	Выборка = РегистрыСведений.алк_ПакетыПоАддендумам.ПолучитьСписокСерийныхНомеровПоАддендуму(ДокументСсылка, ИдентификаторТовара);
	Если Выборка.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	УдаляемыйУникальныйИдентификатор = Неопределено;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено тогда
		УдаляемыйУникальныйИдентификатор = ТекущаяСтрока.ИдентификаторТовара;
	Иначе
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПроверитьНаличиеПривязанныхПакетовКИдентификаторуПриУдалении(Объект.Ссылка, УдаляемыйУникальныйИдентификатор, Отказ);
	КонецЕсли;
	Если Отказ тогда
		Сообщить("Удаление строки невозможно! Есть пакеты привязанные к аддендуму по идентификатору этой строки.");	
	Иначе
		Счетчик = 0;
		Пока Счетчик < Объект.СоставТоваров.Количество() Цикл
			Если Объект.СоставТоваров[Счетчик].ИдентификаторТовара = УдаляемыйУникальныйИдентификатор тогда
				Объект.СоставТоваров.Удалить(Объект.СоставТоваров[Счетчик]);
			Иначе
				Счетчик = Счетчик + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Процедура - Перейти на страницу состав товара
//
// Параметры:
//  Туда - Булево - Истина - туда, Ложь - обратно
//
Процедура ПерейтиНаСтраницуСоставТовара(Туда)
	
	Элементы.ГруппаСоставТоваров.Видимость = Туда;
	Элементы.ГруппаТовары.Видимость = Не Туда;
	Элементы.Страницы.ТекущаяСтраница = ?(Туда, Элементы.ГруппаСоставТоваров, Элементы.ГруппаТовары);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСоставТовара(Команда)
	
	УдалитьПустыеСтрокиВСоставеТоваров();
	
	ВызватьЭкспортнуюПроцедуруПоискПересечений();
			
	Если Не РучноеПредставлениеТекущейСтроки Или Не ЗначениеЗаполнено(ПредставлениеТекущейСтроки) тогда
		ПредставлениеТекущейСтроки = ПолучитьПредставлениеТовараНаСервере(Объект.СоставТоваров, ИдентификаторТекущейСтроки,НоменклатураТекущейСтроки);
	КонецЕсли;
	Для каждого Товар из Объект.Товары Цикл
		Если Товар.ИдентификаторТовара = ИдентификаторТекущейСтроки тогда
			Товар.Номенклатура = НоменклатураТекущейСтроки;
			Товар.ПредставлениеТовара = ПредставлениеТекущейСтроки;
			Товар.ПредставлениеВручную = РучноеПредставлениеТекущейСтроки;
			Если Товар.Номенклатура = ВернутьПиломатериал() Тогда 
				Товар.КатегорияПЭО = УстановитьКатегориюПЭОДляТовара();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ПерейтиНаСтраницуСоставТовара(Ложь);
КонецПроцедуры

&НаСервере
Функция УстановитьКатегориюПЭОДляТовара()
	Возврат Документы.алк_Аддендумы.УстановитьКатегориюПЭО(Объект.СоставТоваров.Выгрузить(Объект.СоставТоваров.НайтиСтроки(Новый Структура("ИдентификаторТовара",ИдентификаторТекущейСтроки))));
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьПиломатериал()
	Возврат Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001");
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеТовараНаСервере(ЗНАЧ ТабличнаяЧасть, ИдентификаторСтроки,Номенклатура)
	Возврат Документы.алк_Аддендумы.ПолучитьПредставлениеТовара(ТабличнаяЧасть, ИдентификаторСтроки,Номенклатура);
КонецФункции

&НаКлиенте
Процедура СоставТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
			
	Если Не ЗначениеЗаполнено(НоменклатураТекущейСтроки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для добавления состава товаров, обязательно требуется заполнить номенклатуру", , "НоменклатураТекущейСтроки", "НоменклатураТекущейСтроки");
	Иначе
		Состав = Объект.СоставТоваров.Добавить();
		Состав.ИдентификаторТовара = ИдентификаторТекущейСтроки;
		Элементы.СоставТоваров.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторТовара", ИдентификаторТекущейСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаСоставТоваров.Видимость = ложь;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостав(Команда)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено тогда
		Сообщить("Не выделена строка товаров");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо выбрать номенклатуру!";
		Сообщение.Поле = "Объект.Товары["+"Объект.Товары.Индекс(ТекущиеДанные)" +"].Номенклатура";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	НоменклатураТекущейСтроки = ТекущиеДанные.Номенклатура;
	ПриИзмененииНоменклатуры();                                 
	ИдентификаторТекущейСтроки = ТекущиеДанные.ИдентификаторТовара;
	ПредставлениеТекущейСтроки = ТекущиеДанные.ПредставлениеТовара;
	РучноеПредставлениеТекущейСтроки = ТекущиеДанные.ПредставлениеВручную;
	
	ПерейтиНаСтраницуСоставТовара(Истина);
	
	Элементы.СоставТоваров.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторТовара", ИдентификаторТекущейСтроки); 
	
	ИзменениеСоставаТовараПоНоменклатуре() 
	
КонецПроцедуры

&НаКлиенте
Процедура РучноеПредставлениеТекущейСтрокиПриИзменении(Элемент)
	Если Не РучноеПредставлениеТекущейСтроки тогда
		ПредставлениеТекущейСтроки = ПолучитьПредставлениеТовараНаСервере(Объект.СоставТоваров, ИдентификаторТекущейСтроки,НоменклатураТекущейСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) тогда
		Объект.Статус = Перечисления.алк_СтатусыАддендума.Черновик;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму()
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеТекущейСтрокиПриИзменении(Элемент)
	Если ПредставлениеТекущейСтроки <> ПолучитьПредставлениеТовараНаСервере(Объект.СоставТоваров, ИдентификаторТекущейСтроки,НоменклатураТекущейСтроки) тогда
		РучноеПредставлениеТекущейСтроки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПредставлениеТовараПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.ПредставлениеТовара <> ПолучитьПредставлениеТовараНаСервере(Объект.СоставТоваров, ТекущаяСтрока.ИдентификаторТовара,ТекущаяСтрока.Номенклатура) тогда
		ТекущаяСтрока.ПредставлениеВручную = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииНомеклатуры(Вопрос,ИзменениеТекСтроки,НоменклатураДоИзменения) 
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПоИзменениюНомеклатуры",
	ЭтотОбъект,Новый Структура("ИзменениеТекСтроки,НоменклатураДоИзменения",ИзменениеТекСтроки,НоменклатураДоИзменения));	
	
	ПоказатьВопрос(Оповещение,
	Вопрос,
	РежимДиалогаВопрос.ДаНет,
	0, 
	КодВозвратаДиалога.Да, 
	"Внимание!" 
	);    
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПоИзменениюНомеклатуры(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Если Параметры.ИзменениеТекСтроки Тогда
			Элементы.Товары.ТекущиеДанные.Номенклатура = Параметры.НоменклатураДоИзменения; 
		Иначе 
			НоменклатураТекущейСтроки = Параметры.НоменклатураДоИзменения;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Параметры.ИзменениеТекСтроки Тогда 
			ТекДанные = Элементы.Товары.ТекущиеДанные;
			Идентификатор = ТекДанные.ИдентификаторТовара; 
			ТекДанные.ИдентификаторТовара = ПолучитьНовыйУникальныйИдентификатор();
			ТекДанные.КатегорияПЭО = "";
			ТекДанные.ПредставлениеТовара = "";
			ТекДанные.Количество = ""; 
			ТекДанные.Цена = "";
			ТекДанные.Сумма = "";
			ТекДанные.ПредставлениеВручную = "";	
		Иначе
			Идентификатор = Элементы.СоставТоваров.ТекущиеДанные.ИдентификаторТовара;
			ПриИзмененииНоменклатуры();
			ИзменениеСоставаТовараПоНоменклатуре();
		КонецЕсли;
		ОчиститьТЧСоставТовараПоИдентификатору(Идентификатор);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ОчиститьТЧСоставТовараПоИдентификатору(Идентификатор) 
	НайденныеСтрокиВСоставеТовара = Объект.СоставТоваров.НайтиСтроки(Новый Структура("ИдентификаторТовара",Идентификатор)); 
	Если НайденныеСтрокиВСоставеТовара.Количество() <> 0 Тогда 
		Для Каждого стр ИЗ НайденныеСтрокиВСоставеТовара Цикл
			Объект.СоставТоваров.Удалить(стр);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеСоставаТовараПоНоменклатуре()
	Если УстановитьЗначениеПеллеты(НоменклатураТекущейСтроки) Тогда
		УстановитьВидимостьПриИзмененииНоменклатурыВСоставеТовара(Ложь,Истина,Ложь);
	Иначе
		УстановитьВидимостьПриИзмененииНоменклатурыВСоставеТовара(Истина,Ложь,КруглоеСечениеНоменклатуры(НоменклатураТекущейСтроки));
	КонецЕсли;  
КонецПроцедуры 

//возращает ложь/истина
&НаСервереБезКонтекста
Функция КруглоеСечениеНоменклатуры(Номенклатура) 	
	Возврат Документы.алк_Аддендумы.КруглоеСечение(Номенклатура);	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьПриИзмененииНоменклатурыВСоставеТовара(ВидимостьДляПМШпона,ВидимостьДляПеллет,ВидимостьКруглоеСечение)
	Элементы.СоставТоваровВариантПрипуска.Видимость = ВидимостьДляПМШпона;
	Элементы.СоставТоваровВлажностьДо.Видимость = ВидимостьДляПМШпона;
	Элементы.СоставТоваровВлажностьОт.Видимость = ВидимостьДляПМШпона;
	Элементы.СоставТоваровДлинаДо.Видимость = ВидимостьДляПМШпона;
	Элементы.СоставТоваровДлинаОт.Видимость = ВидимостьДляПМШпона;
	Элементы.СоставТоваровПорода.Видимость = ВидимостьДляПМШпона;
	Элементы.СоставТоваровСорт.Видимость = ВидимостьДляПМШпона;
	
	Если НЕ ВидимостьДляПеллет Тогда  
		Элементы.СоставТоваровТолщинаДо.Видимость = НЕ ВидимостьКруглоеСечение;
		Элементы.СоставТоваровТолщинаОт.Видимость = НЕ ВидимостьКруглоеСечение;
		Элементы.СоставТоваровШиринаДо.Видимость = НЕ ВидимостьКруглоеСечение;
		Элементы.СоставТоваровШиринаОт.Видимость = НЕ ВидимостьКруглоеСечение;
		Элементы.СоставТоваровДиаметрОт.Видимость = ВидимостьКруглоеСечение;  
		Элементы.СоставТоваровДиаметрДо.Видимость = ВидимостьКруглоеСечение;  
	Иначе 
		Элементы.СоставТоваровТолщинаДо.Видимость = НЕ ВидимостьДляПеллет;
		Элементы.СоставТоваровТолщинаОт.Видимость = НЕ ВидимостьДляПеллет;
		Элементы.СоставТоваровШиринаДо.Видимость = НЕ ВидимостьДляПеллет;
		Элементы.СоставТоваровШиринаОт.Видимость = НЕ ВидимостьДляПеллет;
		Элементы.СоставТоваровДиаметрОт.Видимость = НЕ ВидимостьДляПеллет;  
		Элементы.СоставТоваровДиаметрДо.Видимость = НЕ ВидимостьДляПеллет; 
	КонецЕсли;
	
	Элементы.СоставТоваровХарактеристика.Видимость = ВидимостьДляПеллет;   
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьЗначениеПеллеты(НоменклатураТекущейСтроки) 
	
	Возврат Справочники.Номенклатура.НайтиПоКоду("ПБ-00000018") = НоменклатураТекущейСтроки            //Пеллеты
				Или Справочники.Номенклатура.НайтиПоКоду("ПБ-00000041") = НоменклатураТекущейСтроки;   //Топливные брикеты 
				
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНоменклатуры()
	КатегорияНоменклатурыТекущейСтроки = РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(НоменклатураТекущейСтроки, "КатегорияНоменклатуры");
КонецПроцедуры

&НаКлиенте
Процедура НомерАддендумаПриИзменении(Элемент)
	ЗаполнитьНаименованиеПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ДатаАддендумаПриИзменении(Элемент)
	ЗаполнитьНаименованиеПоШаблону();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ЗаполнитьНаименованиеПоШаблону();
КонецПроцедуры  

Процедура ЗаполнитьНаименованиеПоШаблону()
	Объект.Наименование = ?(ЗначениеЗаполнено(Объект.Договор), РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(Объект.Договор,"Наименование") + " ", "") 
						+ ?(ЗначениеЗаполнено(Объект.НомерАддендума), "Адд.№" + Объект.НомерАддендума + " ", "")
						+ ?(ЗначениеЗаполнено(Объект.ДатаАддендума), "от " + Формат(Объект.ДатаАддендума,"ДЛФ=D") + " ", "");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьМассивХарактеристикПеллет() 
	
	МассивХарактеристик = Новый Массив;
	
	МассивХарактеристик.Добавить(Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048202")); //упаковка 0,65 т.
	МассивХарактеристик.Добавить(Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048203")); //упаковка 1,00 т.
	МассивХарактеристик.Добавить(Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000048629")); //упаковка 14,00 т.
	МассивХарактеристик.Добавить(Справочники.ХарактеристикиНоменклатуры.НайтиПоКоду("000049726")); //Хоппер
	
	Возврат МассивХарактеристик;
	
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	ТекНоменклатура = ТекДанные.Номенклатура;
	
	ТекИдентификаторТовара = ТекДанные.ИдентификаторТовара; 
	
	КоличествоНайденныхСтрокВСоставеТовараПоИдентификатору = Объект.СоставТоваров.НайтиСтроки(Новый Структура("ИдентификаторТовара",ТекИдентификаторТовара)).Количество(); 
	
	//если в составе товара нет данных по товару, тогда не задаем вопрос про очищение
	Если КоличествоНайденныхСтрокВСоставеТовараПоИдентификатору = 0 Тогда 
		Возврат;
	КонецЕсли;
	//\\
	
	ВопросПриИзмененииНомеклатуры("Текущие данные по товару будут очищены! Продолжить?",Истина,ТекНоменклатура);  
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураТекущейСтрокиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СоставТоваров.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда  
		//так как номенклатура связана с характеристикой 
		//при изменении номенклатуры, характеристика тоже очистится
		//поэтому запишем характеристики до изменения
		
		ВопросПриИзмененииНомеклатуры("Табличная часть будет очищена! Продолжить?",Ложь,НоменклатураТекущейСтроки);
	Иначе 
		ПриИзмененииНоменклатуры();
		ИзменениеСоставаТовараПоНоменклатуре();
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ВызватьЭкспортнуюПроцедуруПоискПересечений()
	Документы.алк_Аддендумы.ПоискПересеченийХарактеристик(Объект.СоставТоваров,Объект.Товары);
КонецПроцедуры

&НаСервере
Процедура УдалитьПустыеСтрокиВСоставеТоваров()
	
	Если УстановитьЗначениеПеллеты(НоменклатураТекущейСтроки) Тогда //Пеллеты и Топливные брикеты
		ПустыеСтроки = Объект.СоставТоваров.НайтиСтроки(Новый Структура ("ИдентификаторТовара,Характеристика",ИдентификаторТекущейСтроки,ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка")));
	Иначе
		ПустыеСтроки = Объект.СоставТоваров.НайтиСтроки(Новый Структура ("ИдентификаторТовара,Порода,Сорт,ШиринаОт,ШиринаДо,ТолщинаОт,ТолщинаДо,ДлинаОт,ДлинаДо,ВлажностьОт,ВлажностьДо",ИдентификаторТекущейСтроки,ПредопределенноеЗначение("Справочник.Породы.ПустаяСсылка"),ПредопределенноеЗначение("Справочник.Сорта.ПустаяСсылка"),0,0,0,0,0,0,0,0));
	КонецЕсли;
	
	Если ПустыеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли; 
	
	Для Каждого эл ИЗ ПустыеСтроки Цикл
		Объект.СоставТоваров.Удалить(эл);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьДоступностьРеквизитовФормы();
КонецПроцедуры                  

Процедура УстановитьДоступностьРеквизитовФормы()
	
	Элементы.Товары.ТолькоПросмотр = Объект.ИзмененияЗапрещены; 
	Элементы.СоставТоваров.ТолькоПросмотр = Объект.ИзмененияЗапрещены;
	Элементы.НомерАддендума.ТолькоПросмотр = Объект.ИзмененияЗапрещены;
	Элементы.ДатаАддендума.ТолькоПросмотр = Объект.ИзмененияЗапрещены;
	Элементы.леваяКолонкаУсловий.ТолькоПросмотр = Объект.ИзмененияЗапрещены;
	Элементы.грТекущаийТовар.Доступность = Не Объект.ИзмененияЗапрещены;
	Элементы.ФормаЗапретитьРедактирование.Картинка = ?(Объект.ИзмененияЗапрещены, БиблиотекаКартинок.СостояниеПоступилоГИСМ, БиблиотекаКартинок.ПодтвердитьПолучениеГИСМ);
	Элементы.ЗапретРедактированияДокумента.Заголовок = ?(Объект.ИзмененияЗапрещены
		, "Установлен запрет редактирования документа, т.к. сделка уже зарегистрирована"
		, "Документ доступен для изменения, т.к. сделка еще не зарегистрирована"); 
	Элементы.ФормаЗапретитьРедактирование.Пометка = Объект.ИзмененияЗапрещены;
	Элементы.ЗапретРедактированияДокумента.ЦветФона = ?(Объект.ИзмененияЗапрещены, новый Цвет(250,170,170), новый Цвет(214,250,198));
	
КонецПроцедуры

&НаСервере
Процедура ЗапретитьРедактированиеНаСервере()
	
	Объект.ИзмененияЗапрещены = Не Объект.ИзмененияЗапрещены;
	Если Не Записать() тогда
		//Если не записался документ, меняем в зад
		Объект.ИзмененияЗапрещены = Не Объект.ИзмененияЗапрещены;
	КонецЕсли;
	УстановитьДоступностьРеквизитовФормы();
		
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьРедактирование(Команда)
	
	Если Модифицированность тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗапретитьРедактированиеЗавершение", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения
			, "Для изменения статуса регистрации документа необходимо записать изменения документа. " + Символы.ПС + " Записать документ?"
			, РежимДиалогаВопрос.ДаНет
			,, КодВозвратаДиалога.Нет, "Записать изменения документа?");	   
	Иначе
		ЗапретитьРедактированиеНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗапретитьРедактированиеЗавершение(Результат, Парамтеры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да тогда
		ЗапретитьРедактированиеНаСервере();
	КонецЕсли; 
	
КонецПроцедуры
